In [1]:
# Setup
import pandas as pd

from utils import render


# Standard Python dictionary
test_balance_data = {
    'pasan': 20.00,
    'treasure': 20.18,
    'ashley': 1.05,
    'craig': 42.42,
}

balances = pd.Series(test_balance_data)

In [2]:
balances[2]

1.05

In [3]:
type(balances[3])

numpy.float64

In [4]:
balances[-2]

1.05

In [5]:
balances.loc['pasan':'ashley']

pasan       20.00
treasure    20.18
ashley       1.05
dtype: float64

In [6]:
import pandas as pd

test_balance_data = {
    'pasan': 20.00,
    'treasure': 20.18,
    'ashley': 1.05,
    'craig': 42.42,
}

test_deposit_data = {
    'pasan': 30,
    'treasure': 10,
    'ashley': 100,
    'craig': 55,   
}

balances = pd.Series(test_balance_data)
deposits = pd.Series(test_deposit_data)

In [7]:
for seve, fettarsch in deposits.items():
    balances[seve] += fettarsch
balances

pasan        50.00
treasure     30.18
ashley      101.05
craig        97.42
dtype: float64

In [8]:
balances -= deposits
balances

pasan       20.00
treasure    20.18
ashley       1.05
craig       42.42
dtype: float64

In [9]:
balances += deposits
balances

pasan        50.00
treasure     30.18
ashley      101.05
craig        97.42
dtype: float64

In [10]:
balances + 5
balances

pasan        50.00
treasure     30.18
ashley      101.05
craig        97.42
dtype: float64

In [11]:
deposits + 5

pasan        35
treasure     15
ashley      105
craig        60
dtype: int64

In [12]:
coupons = pd.Series(7, ['craig', 'ashley', 'james'])
coupons

craig     7
ashley    7
james     7
dtype: int64

In [13]:
balances

pasan        50.00
treasure     30.18
ashley      101.05
craig        97.42
dtype: float64

In [14]:
coupons

craig     7
ashley    7
james     7
dtype: int64

In [15]:
balances + coupons

ashley      108.05
craig       104.42
james          NaN
pasan          NaN
treasure       NaN
dtype: float64

In [16]:
balances.add(coupons, fill_value=0)

ashley      108.05
craig       104.42
james         7.00
pasan        50.00
treasure     30.18
dtype: float64

In [17]:
import pandas as pd

In [18]:
test_users_list = [
    ['Craig', 'Dennis', 42.42],
    ['Treasure', 'Porth', 25.00]
]

pd.DataFrame(test_users_list)

          0       1      2
0     Craig  Dennis  42.42
1  Treasure   Porth  25.00

In [19]:
pd.DataFrame(test_users_list, index=['craigsdennis', 'treasure'],
            columns=['first_name', 'last_name', 'balance'])

             first_name last_name  balance
craigsdennis      Craig    Dennis    42.42
treasure       Treasure     Porth    25.00

In [20]:
test_user_data = {
    'first_name': ['Craig', 'Treasure'],
    'last_name': ['Dennis', 'Porth'],
    'balance': [42.42, 25.00]
}

pd.DataFrame(test_user_data)

  first_name last_name  balance
0      Craig    Dennis    42.42
1   Treasure     Porth    25.00

In [21]:
pd.DataFrame(test_user_data, index=['craigsdennis', 'treasure'])

             first_name last_name  balance
craigsdennis      Craig    Dennis    42.42
treasure       Treasure     Porth    25.00

In [22]:
by_username = {
    'craigsdennis': {
        'first_name': 'Craig',
        'last_name': 'Dennis',
        'balance': 42.42
    },
    'treasure': {
        'first_name': 'Treasure',
        'last_name': 'Porth',
        'balance': 25.00
    }
}

pd.DataFrame.from_dict(by_username, orient='index')

             first_name last_name  balance
craigsdennis      Craig    Dennis    42.42
treasure       Treasure     Porth    25.00

In [23]:
# Setup
import pandas as pd

test_user_data = {
    'first_name': ['Craig', 'Treasure', 'Ashley', 'Guil'],
    'last_name': ['Dennis', 'Porth', 'Boucher', 'Hernandez'],
    'balance': [42.42, 25.00, 2.02, 87.00]
}
test_user_names = ['craigsdennis', 'treasure', 'lindsay2000', 'guil']

users = pd.DataFrame(test_user_data, index=test_user_names)

In [24]:
balances = users['balance']
balances

craigsdennis    42.42
treasure        25.00
lindsay2000      2.02
guil            87.00
Name: balance, dtype: float64

In [25]:
balances.name

'balance'

In [26]:
users.loc['treasure']

first_name    Treasure
last_name        Porth
balance           25.0
Name: treasure, dtype: object

In [27]:
users.loc['craigsdennis']

first_name     Craig
last_name     Dennis
balance        42.42
Name: craigsdennis, dtype: object

In [28]:
users.iloc[0]

first_name     Craig
last_name     Dennis
balance        42.42
Name: craigsdennis, dtype: object

In [29]:
# Setup
import pandas as pd

test_user_data = {
    'first_name': ['Craig', 'Treasure', 'Ashley', 'Guil'],
    'last_name': ['Dennis', 'Porth', 'Boucher', 'Hernandez'],
    'balance': [42.42, 25.00, 2.02, 87.00]
}
test_user_names = ['craigsdennis', 'treasure', 'lindsay2000', 'guil']

users = pd.DataFrame(test_user_data, index=test_user_names)
deposits = pd.Series(test_deposit_data)

In [30]:
users['first_name']['craigsdennis']

'Craig'

In [31]:
users.loc['craigsdennis']['first_name']

'Craig'

In [32]:
users.loc[:, ['balance', 'first_name', 'last_name']]

              balance first_name  last_name
craigsdennis    42.42      Craig     Dennis
treasure        25.00   Treasure      Porth
lindsay2000      2.02     Ashley    Boucher
guil            87.00       Guil  Hernandez

In [33]:
users.loc['treasure':'guil', :]

            first_name  last_name  balance
treasure      Treasure      Porth    25.00
lindsay2000     Ashley    Boucher     2.02
guil              Guil  Hernandez    87.00

In [34]:
users.iloc[0:5, 0:4]

             first_name  last_name  balance
craigsdennis      Craig     Dennis    42.42
treasure       Treasure      Porth    25.00
lindsay2000      Ashley    Boucher     2.02
guil               Guil  Hernandez    87.00

In [35]:
users.iloc[1:2, 1:]

         last_name  balance
treasure     Porth     25.0

In [36]:
# Setup
import os
import pandas as pd

# We use os.path.join because Windows uses a back slash (\) to separate directories
#  while others use a forward slash (/)
users_file_name = os.path.join('data', 'users.csv')
users_file_name

'data\\users.csv'

In [37]:
# Open the file and print out the first 5 lines
with open(users_file_name) as lines:
    for _ in range(5):
        # The `file` object is an iterator, so just get the next line 
        print(next(lines))

,first_name,last_name,email,email_verified,signup_date,referral_count,balance

aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6,18.14

acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2,55.45

adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3,72.12

adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01

In [38]:
users.head()

             first_name  last_name  balance
craigsdennis      Craig     Dennis    42.42
treasure       Treasure      Porth    25.00
lindsay2000      Ashley    Boucher     2.02
guil               Guil  Hernandez    87.00

In [39]:
users = pd.read_csv(users_file_name, index_col=0)

In [40]:
with open(users_file_name) as lines:
    for _ in range(5):
        # The `file` object is an iterator, so just get the next line 
        print(next(lines))

,first_name,last_name,email,email_verified,signup_date,referral_count,balance

aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6,18.14

acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2,55.45

adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3,72.12

adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01

In [41]:
users.head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6,18.14
acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2,55.45
adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3,72.12
adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01
adrian.blair,Adrian,Blair,adrian9335@gmail.com,True,2018-06-16,7,25.85

In [42]:
len(users)

475

In [43]:
users.shape

(475, 7)

In [44]:
users.count()

first_name        475
last_name         430
email             475
email_verified    475
signup_date       475
referral_count    475
balance           475
dtype: int64

In [45]:
users.dtypes

first_name         object
last_name          object
email              object
email_verified       bool
signup_date        object
referral_count      int64
balance           float64
dtype: object

In [46]:
users.describe()

       referral_count     balance
count      475.000000  475.000000
mean         3.429474   49.933263
std          2.281085   28.280448
min          0.000000    0.050000
25%          2.000000   25.305000
50%          3.000000   51.570000
75%          5.000000   74.480000
max          7.000000   99.900000

In [47]:
users.mean()

C:\Users\gabri\AppData\Local\Temp\ipykernel_20580\1867495925.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  users.mean()

email_verified     0.818947
referral_count     3.429474
balance           49.933263
dtype: float64

In [48]:
users.std()

C:\Users\gabri\AppData\Local\Temp\ipykernel_20580\527113547.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  users.std()

email_verified     0.385468
referral_count     2.281085
balance           28.280448
dtype: float64

In [49]:
users.min()

C:\Users\gabri\AppData\Local\Temp\ipykernel_20580\1370270913.py:1: FutureWarning: The default value of numeric_only in DataFrame.min is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  users.min()

first_name                       Aaron
email             aalvarez@hotmail.com
email_verified                   False
signup_date                 2018-01-01
referral_count                       0
balance                           0.05
dtype: object

In [50]:
users.max()

C:\Users\gabri\AppData\Local\Temp\ipykernel_20580\160620571.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  users.max()

first_name                Zachary
email             zneal@gmail.com
email_verified               True
signup_date            2018-09-25
referral_count                  7
balance                      99.9
dtype: object

In [51]:
users.email_verified.value_counts()

True     389
False     86
Name: email_verified, dtype: int64

In [52]:
users.first_name.value_counts().head()

Mark           11
David          10
Michael         9
Christopher     7
Robert          7
Name: first_name, dtype: int64

In [53]:
users.sort_values(by='balance', ascending=False).head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
twhite,Timothy,White,white5136@hotmail.com,True,2018-07-06,5,99.90
karen.snow,Karen,Snow,ksnow@yahoo.com,True,2018-05-06,2,99.38
king,Billy,King,billy.king@hotmail.com,True,2018-05-29,4,98.80
king3246,Brittney,King,brittney@yahoo.com,True,2018-04-15,6,98.79
crane203,Valerie,Crane,valerie7051@hotmail.com,True,2018-05-12,3,98.69

In [54]:
# Sort first by last_name and then first_name. By default, np.nan show up at the end
users.sort_values(by=['last_name', 'first_name'], inplace=True)
# Sort order is now changed
users.head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
darlene.adams,Darlene,Adams,adams@hotmail.com,True,2018-09-15,2,67.02
lauren,Lauren,Aguilar,lauren.aguilar@summers.com,False,2018-05-31,4,69.90
daniel,Daniel,Allen,allen@hotmail.com,False,2018-07-01,2,21.21
kallen,Kathy,Allen,kathy@hotmail.com,False,2018-02-20,1,43.72
alvarado,Denise,Alvarado,alvarado@hotmail.com,True,2018-09-07,6,26.72

In [55]:
users.sort_index(inplace=True)
users.head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6,18.14
acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2,55.45
adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3,72.12
adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01
adrian.blair,Adrian,Blair,adrian9335@gmail.com,True,2018-06-16,7,25.85

In [56]:
import os
import pandas as pd

users = pd.read_csv(os.path.join('data', 'users.csv'), index_col=0)
# Pop out a quick sanity check
len(users)

475

In [57]:
# This vectorized comparison returns a new `Series` ... 
#   We are naming it so we can use it later.
no_referrals_index = users['referral_count'] < 1
# See how the boolean `Series` returned includes all rows from the `DataFrame`.
#  The value is the result of each comparison
no_referrals_index.head()

aaron            False
acook            False
adam.saunders    False
adrian           False
adrian.blair     False
Name: referral_count, dtype: bool

In [58]:
users[no_referrals_index].head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
alan9443,Alan,Pope,pope@hotmail.com,True,2018-04-17,0,56.09
andrew.alvarez,Andrew,Alvarez,aalvarez@hotmail.com,False,2018-08-01,0,81.66
boyer7005,Sara,Boyer,boyer8636@gmail.com,True,2018-07-31,0,91.41
brandon.gilbert,Brandon,Gilbert,brandon.gilbert@hotmail.com,True,2018-04-28,0,10.17
brooke2027,Brooke,NaN,brooke6938@gmail.com,False,2018-05-23,0,7.22

In [59]:
~no_referrals_index.head()

aaron            True
acook            True
adam.saunders    True
adrian           True
adrian.blair     True
Name: referral_count, dtype: bool

In [60]:
~no_referrals_index.head()

aaron            True
acook            True
adam.saunders    True
adrian           True
adrian.blair     True
Name: referral_count, dtype: bool

In [61]:
users[~no_referrals_index].head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6,18.14
acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2,55.45
adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3,72.12
adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01
adrian.blair,Adrian,Blair,adrian9335@gmail.com,True,2018-06-16,7,25.85

In [62]:
users.loc[no_referrals_index, ['balance', 'email']].head()

                 balance                        email
alan9443           56.09             pope@hotmail.com
andrew.alvarez     81.66         aalvarez@hotmail.com
boyer7005          91.41          boyer8636@gmail.com
brandon.gilbert    10.17  brandon.gilbert@hotmail.com
brooke2027          7.22         brooke6938@gmail.com

In [63]:
users[users['referral_count'] == 0].head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
alan9443,Alan,Pope,pope@hotmail.com,True,2018-04-17,0,56.09
andrew.alvarez,Andrew,Alvarez,aalvarez@hotmail.com,False,2018-08-01,0,81.66
boyer7005,Sara,Boyer,boyer8636@gmail.com,True,2018-07-31,0,91.41
brandon.gilbert,Brandon,Gilbert,brandon.gilbert@hotmail.com,True,2018-04-28,0,10.17
brooke2027,Brooke,NaN,brooke6938@gmail.com,False,2018-05-23,0,7.22

In [64]:
users[(users['referral_count'] == 0) & (users['email_verified'] == True)].head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
alan9443,Alan,Pope,pope@hotmail.com,True,2018-04-17,0,56.09
boyer7005,Sara,Boyer,boyer8636@gmail.com,True,2018-07-31,0,91.41
brandon.gilbert,Brandon,Gilbert,brandon.gilbert@hotmail.com,True,2018-04-28,0,10.17
bryant,Darlene,Bryant,dbryant@yahoo.com,True,2018-07-19,0,36.91
calvin.perez,Calvin,Perez,cperez@gmail.com,True,2018-02-17,0,13.01

In [65]:
# Setup
from datetime import datetime
import os

import numpy as np
import pandas as pd

users = pd.read_csv(os.path.join('data', 'users.csv'), index_col=0)
transactions = pd.read_csv(os.path.join('data', 'transactions.csv'), index_col=0)
# Pop out a quick sanity check
(users.shape, transactions.shape)

((475, 7), (998, 4))

In [66]:
users[(users.first_name == "Adrian")]

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01
adrian.blair,Adrian,Blair,adrian9335@gmail.com,True,2018-06-16,7,25.85

In [67]:
users[(users.first_name == "Adrian") & (users.last_name == "Fang")]['balance']

adrian    30.01
Name: balance, dtype: float64

In [68]:
users.loc[(users.first_name == "Adrian") & (users.last_name == "Fang"), 'balance'] = 35.00
# Display our updated user with the new value assigned
users.loc['adrian']

first_name                               Adrian
last_name                                  Fang
email             adrian.fang@teamtreehouse.com
email_verified                             True
signup_date                          2018-04-28
referral_count                                3
balance                                    35.0
Name: adrian, dtype: object

In [69]:
users.at['adrian', 'balance'] = 35.00

In [70]:
transactions.head()

       sender      receiver  amount   sent_date
0       stein        smoyer   49.03  2018-01-24
1  holden4580  joshua.henry   34.64  2018-02-06
2  rose.eaton   emily.lewis   62.67  2018-02-15
3      lmoore        kallen    1.94  2018-03-05
4   scott3928        lmoore   27.82  2018-03-10

In [71]:
record = dict(sender=np.nan, receiver='adrian', amount=4.99, sent_date=datetime.now().date())

In [72]:
transactions.append(record, ignore_index=True).tail()

C:\Users\gabri\AppData\Local\Temp\ipykernel_20580\425671274.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  transactions.append(record, ignore_index=True).tail()

         sender      receiver  amount   sent_date
994    king3246          john   25.37  2018-09-25
995  shernandez   kristen1581   75.77  2018-09-25
996    leah6255     jholloway   63.62  2018-09-25
997      pamela  michelle4225    2.54  2018-09-25
998         NaN        adrian    4.99  2023-02-17

In [73]:
# Largest current record, incremented
next_key = transactions.index.max() + 1
transactions.loc[next_key] = record 
# Make sure it got added
transactions.tail()

         sender      receiver  amount   sent_date
994    king3246          john   25.37  2018-09-25
995  shernandez   kristen1581   75.77  2018-09-25
996    leah6255     jholloway   63.62  2018-09-25
997      pamela  michelle4225    2.54  2018-09-25
998         NaN        adrian    4.99  2023-02-17

In [74]:
latest_id = transactions.index.max()
# Add a new column named notes
transactions.at[latest_id, 'notes'] = 'Adrian called customer support to report billing error.'
transactions.tail()

,sender,receiver,amount,sent_date,notes
994,king3246,john,25.37,2018-09-25,NaN
995,shernandez,kristen1581,75.77,2018-09-25,NaN
996,leah6255,jholloway,63.62,2018-09-25,NaN
997,pamela,michelle4225,2.54,2018-09-25,NaN
998,NaN,adrian,4.99,2023-02-17,Adrian called customer support to report billi...

In [75]:
transactions['large'] = transactions.amount > 70

In [76]:
transactions.rename(columns={'large': 'big_sender'}, inplace=True)
transactions.head()

       sender      receiver  amount   sent_date notes  big_sender
0       stein        smoyer   49.03  2018-01-24   NaN       False
1  holden4580  joshua.henry   34.64  2018-02-06   NaN       False
2  rose.eaton   emily.lewis   62.67  2018-02-15   NaN       False
3      lmoore        kallen    1.94  2018-03-05   NaN       False
4   scott3928        lmoore   27.82  2018-03-10   NaN       False

In [77]:
transactions.drop(columns=['notes'], inplace=True)
transactions.head()

       sender      receiver  amount   sent_date  big_sender
0       stein        smoyer   49.03  2018-01-24       False
1  holden4580  joshua.henry   34.64  2018-02-06       False
2  rose.eaton   emily.lewis   62.67  2018-02-15       False
3      lmoore        kallen    1.94  2018-03-05       False
4   scott3928        lmoore   27.82  2018-03-10       False

In [78]:
transactions.drop(['big_sender'], axis='columns', inplace=True)
transactions.head()

       sender      receiver  amount   sent_date
0       stein        smoyer   49.03  2018-01-24
1  holden4580  joshua.henry   34.64  2018-02-06
2  rose.eaton   emily.lewis   62.67  2018-02-15
3      lmoore        kallen    1.94  2018-03-05
4   scott3928        lmoore   27.82  2018-03-10

In [79]:
last_key = transactions.index.max()
transactions.drop(index=[last_key], inplace=True)
transactions.tail()

         sender      receiver  amount   sent_date
993     coleman   sarah.evans   36.29  2018-09-25
994    king3246          john   25.37  2018-09-25
995  shernandez   kristen1581   75.77  2018-09-25
996    leah6255     jholloway   63.62  2018-09-25
997      pamela  michelle4225    2.54  2018-09-25

In [80]:
from datetime import datetime
import os

import pandas as pd

from utils import render

transactions = pd.read_csv(os.path.join('data', 'transactions.csv'), index_col=0)
requests = pd.read_csv(os.path.join('data', 'requests.csv'), index_col=0)

# Pop out a quick sanity check
(transactions.shape, requests.shape)

((998, 4), (313, 4))

In [81]:
# Since we are calling merge on the `requests` DataFrame it is considered the left side
successful_requests = requests.merge(
    # And transactions is the right side
    transactions, 
    # So now we line up columns that will make the join make sense.
    left_on=['from_user', 'to_user', 'amount'], 
    right_on=['receiver', 'sender', 'amount']
)
# Let's take a look and see how we did
successful_requests.head()

,from_user,to_user,amount,request_date,sender,receiver,sent_date
0,chad.chen,paula7980,78.61,2018-02-12,paula7980,chad.chen,2018-07-15
1,kallen,lmoore,1.94,2018-02-23,lmoore,kallen,2018-03-05
2,gregory.blackwell,rodriguez5768,30.57,2018-03-04,rodriguez5768,gregory.blackwell,2018-03-17
3,kristina.miller,john.hardy,77.05,2018-03-12,john.hardy,kristina.miller,2018-04-25
4,lacey8987,mcguire,54.09,2018-03-13,mcguire,lacey8987,2018-06-28

In [82]:
successful_requests['request_date'] = pd.to_datetime(successful_requests['request_date'])
successful_requests['sent_date'] = pd.to_datetime(successful_requests['sent_date'])
# And now we can see they are converted
successful_requests.dtypes

from_user               object
to_user                 object
amount                 float64
request_date    datetime64[ns]
sender                  object
receiver                object
sent_date       datetime64[ns]
dtype: object

In [83]:
successful_requests['time_passed'] = successful_requests.sent_date - successful_requests.request_date

In [84]:
successful_requests.sort_values(by='time_passed', ascending=False).head(5)

,from_user,to_user,amount,request_date,sender,receiver,sent_date,time_passed
0,chad.chen,paula7980,78.61,2018-02-12,paula7980,chad.chen,2018-07-15,153 days
33,sthompson,andrade,14.07,2018-05-09,andrade,sthompson,2018-09-21,135 days
4,lacey8987,mcguire,54.09,2018-03-13,mcguire,lacey8987,2018-06-28,107 days
53,marcus.berry,melissa.mendoza,71.48,2018-05-31,melissa.mendoza,marcus.berry,2018-09-06,98 days
39,bishop,massey2102,18.27,2018-05-16,massey2102,bishop,2018-08-15,91 days

In [85]:
"Wow! ${:,.2f} has passed through the request system in {} transactions!!!".format(
    successful_requests.amount.sum(),
    len(successful_requests),
)

'Wow! $10,496.47 has passed through the request system in 214 transactions!!!'

In [86]:
# Setup
from datetime import datetime
import os

import numpy as np
import pandas as pd

from utils import render

users = pd.read_csv(os.path.join('data', 'users.csv'), index_col=0)
transactions = pd.read_csv(os.path.join('data', 'transactions.csv'), index_col=0)
requests = pd.read_csv(os.path.join('data', 'requests.csv'), index_col=0)

# Perform the merge from the previous notebook 
#  (s2n06-combining-dataframes.ipynb)
successful_requests = requests.merge(
    transactions,
    left_on=['from_user', 'to_user', 'amount'], 
    right_on=['receiver', 'sender', 'amount']
)

# Statement from previous notebook
"Wow! ${:,.2f} has passed through the request system in {} transactions!!!".format(
    successful_requests.amount.sum(),
    len(successful_requests),
)

'Wow! $10,496.47 has passed through the request system in 214 transactions!!!'

In [87]:
# Let's get our records sorted chronologically
successful_requests.sort_values('request_date', inplace=True) 

# And then we'll drop dupes keeping only the last one. 
#  Note the use of the inplace keyword
successful_requests.drop_duplicates(('from_user', 'to_user', 'amount'), keep='last', inplace=True)

# Statement from previous notebook
"Wow! ${:,.2f} has passed through the request system in {} transactions!!!".format(
    successful_requests.amount.sum(),
    len(successful_requests),
)

'Wow! $9,316.12 has passed through the request system in 191 transactions!!!'

In [88]:
# Create a boolean array where we check to see if the label (username) 
#   is in the `from_user` Series.
made_request_index = users.index.isin(requests.from_user)
# This will get us a list of all users who **have** made a request
users[made_request_index].head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6,18.14
acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2,55.45
adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3,72.12
adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01
adrian.blair,Adrian,Blair,adrian9335@gmail.com,True,2018-06-16,7,25.85

In [89]:
users[~made_request_index].head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
alan9443,Alan,Pope,pope@hotmail.com,True,2018-04-17,0,56.09
alvarado,Denise,Alvarado,alvarado@hotmail.com,True,2018-09-07,6,26.72
amiller,Anne,Miller,miller@hotmail.com,False,2018-06-02,5,86.28
andersen,Mark,Andersen,mark.andersen@yahoo.com,True,2018-08-21,3,75.69
andrade,Melissa,Andrade,mandrade@yahoo.com,True,2018-01-06,3,83.22

In [90]:
users.count()

first_name        475
last_name         430
email             475
email_verified    475
signup_date       475
referral_count    475
balance           475
dtype: int64

In [91]:
# Gather all users where the last name is missing
users[users.last_name.isna()].head()

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
anthony3761,Anthony,NaN,anthony9581@gmail.com,True,2018-08-16,6,59.81
bradley,Bradley,NaN,bradley3941@henderson.com,True,2018-06-24,4,22.24
bradley7808,Bradley,NaN,bradley8794@yahoo.com,True,2018-06-15,1,76.49
brenda,Brenda,NaN,brenda@hotmail.com,True,2018-07-28,7,6.18
brooke2027,Brooke,NaN,brooke6938@gmail.com,False,2018-05-23,0,7.22

In [92]:
# Make a copy of the DataFrame with "Unknown" as the last name where it is missing
users_with_unknown = users.fillna('Unknown')

# Make sure we got 'em all
users_with_unknown[users_with_unknown.last_name.isna()]

Empty DataFrame
Columns: [first_name, last_name, email, email_verified, signup_date, referral_count, balance]
Index: []

In [93]:
users_with_last_names = users.dropna()

# Row counts of the original 
(len(users), len(users_with_last_names))

(475, 430)

In [94]:
# Setup
import os

import pandas as pd

from utils import make_chaos

pd.options.display.max_rows = 10
transactions = pd.read_csv(os.path.join('data', 'transactions.csv'), index_col=0)
# Pay no attention to the person behind the curtain
make_chaos(transactions, 42, ['sender'], lambda val: '$' + val)
make_chaos(transactions, 88, ['receiver'], lambda val: val.upper())

In [95]:
transactions[transactions.sender.str.startswith('$')]

              sender       receiver  amount   sent_date
59           $porter       gail7896   75.16  2018-05-14
70      $emily.lewis          kevin    5.49  2018-05-21
158        $robinson      rodriguez    8.91  2018-06-25
168           $nancy    margaret265   84.15  2018-06-26
198           $acook  adam.saunders    9.31  2018-07-04
..               ...            ...     ...         ...
877       $april9082    jacob.davis   50.37  2018-09-21
889          $victor    anthony1788   39.06  2018-09-21
900        $andersen   corey.ingram    4.81  2018-09-22
927  $janet.williams         bsmith   50.15  2018-09-23
934      $robert8280          roger   98.35  2018-09-24

[42 rows x 4 columns]

In [96]:
# Replace all "$" in the sender field with an empty string
transactions.sender = transactions.sender.str.replace('$', '') 
# Verify we got them all
len(transactions[transactions.sender.str.startswith('$')])

C:\Users\gabri\AppData\Local\Temp\ipykernel_20580\2070587804.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  transactions.sender = transactions.sender.str.replace('$', '')

0

In [97]:
transactions[transactions.receiver.str.isupper()]

                sender      receiver  amount   sent_date
2           rose.eaton   EMILY.LEWIS   62.67  2018-02-15
5    francis.hernandez        LMOORE   91.46  2018-03-14
14              palmer     CHAD.CHEN   36.27  2018-04-07
28               elang     DONNA1922   26.07  2018-04-23
34               payne   GRIFFIN4992   85.21  2018-04-26
..                 ...           ...     ...         ...
963        stanley7729  JOSEPH.LOPEZ   50.84  2018-09-25
977         martha6969      PATRICIA   87.33  2018-09-25
987           alvarado        PAMELA   48.74  2018-09-25
990             robert  HEATHER.WADE   86.44  2018-09-25
992             pamela         CALEB   25.01  2018-09-25

[88 rows x 4 columns]

In [98]:
# Update the receiver column of the specific rows that are uppercased.
transactions.loc[transactions.receiver.str.isupper(), 'receiver'] = transactions.receiver.str.lower()
# Verify that we got them
len(transactions[transactions.receiver.str.isupper()])

0

In [99]:
# Setup
import os

import pandas as pd

from utils import make_chaos

from tests.helpers import check

pd.options.display.max_rows = 10
users = pd.read_csv(os.path.join('data', 'users.csv'), index_col=0)
# Pay no attention to the person behind the curtain
make_chaos(users, 19, ['first_name'], lambda val: val.lower())

In [100]:
## CHALLENGE - Verified email list ##

# TODO: Narrow list to those that have email verified.
#  The only columns should be first, last and email
email_list = users[:]

# TODO: Remove any rows missing last names


# TODO: Ensure that the first names are the proper case


# Return the new sorted DataFrame..last name then first name ascending
email_list

,first_name,last_name,email,email_verified,signup_date,referral_count,balance
aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6.0,18.14
acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2.0,55.45
adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3.0,72.12
adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3.0,30.01
adrian.blair,Adrian,Blair,adrian9335@gmail.com,True,2018-06-16,7.0,25.85
...,...,...,...,...,...,...,...
wilson,Robert,Wilson,robert@yahoo.com,False,2018-05-16,5.0,59.75
wking,Wanda,King,wanda.king@holt.com,True,2018-06-01,2.0,67.08
wright3590,Jacqueline,Wright,jacqueline.wright@gonzalez.com,True,2018-02-08,6.0,18.48
young,Jessica,Young,jessica4028@yahoo.com,True,2018-07-17,4.0,75.39
zachary.neal,Zachary,Neal,zneal@gmail.com,True,2018-07-26,1.0,39.90

In [102]:
check(__name__, 'Verified email list')

Button(description='Run Tests', style=ButtonStyle())

```
EEEEE
======================================================================
ERROR: test_columns (tests.helpers.TestVerifiedEmailList)
----------------------------------------------------------------------
Traceback (most recent call last):
  File "C:\Users\gabri\intro-to-numpy\Introduction to Pandas\tests\test_cells.py", line 89, in test_columns
    len(self.df.columns),
AttributeError: 'NoneType' object has no attribute 'columns'

======================================================================
ERROR: test_email_verified (tests.helpers.TestVerifiedEmailList)
----------------------------------------------------------------------
Traceback (most recent call last):
  File "C:\Users\gabri\intro-to-numpy\Introduction to Pandas\tests\test_cells.py", line 98, in test_email_verified
    len(self.df),
TypeError: object of type 'NoneType' has no len()

======================================================================
ERROR: test_has_na (tests.helpers.TestVerifiedEmailList)
----------------------------------------------------------------------
Traceback (most recent call last):
  File "C:\Users\gabri\intro-to-numpy\Introduction to Pandas\tests\test_cells.py", line 81, in test_has_na
    sum(self.df.last_name.isna()),
AttributeError: 'NoneType' object has no attribute 'last_name'

======================================================================
ERROR: test_sort (tests.helpers.TestVerifiedEmailList)
----------------------------------------------------------------------
Traceback (most recent call last):
  File "C:\Users\gabri\intro-to-numpy\Introduction to Pandas\tests\test_cells.py", line 114, in test_sort
    self.df.iloc[0, 0],
AttributeError: 'NoneType' object has no attribute 'iloc'

======================================================================
ERROR: test_title_cased (tests.helpers.TestVerifiedEmailList)
----------------------------------------------------------------------
Traceback (most recent call last):
  File "C:\Users\gabri\intro-to-numpy\Introduction to Pandas\tests\test_cells.py", line 105, in test_title_cased
    sum(self.df.first_name.str.islower()),
AttributeError: 'NoneType' object has no attribute 'first_name'

----------------------------------------------------------------------
Ran 5 tests in 0.051s

FAILED (errors=5)

```

In [103]:
# Setup
import os

import pandas as pd

pd.options.display.max_rows = 10
users = pd.read_csv(os.path.join('data', 'users.csv'), index_col=0)
transactions = pd.read_csv(os.path.join('data', 'transactions.csv'), index_col=0)
# Sanity check
(len(users), len(transactions))

(475, 998)

In [104]:
grouped_by_receiver = transactions.groupby('receiver')

# Let's see what type of object we got back
type(grouped_by_receiver)

pandas.core.groupby.generic.DataFrameGroupBy

In [105]:
# Returns a Series of total number of rows
grouped_by_receiver.size()

receiver
aaron            6
acook            1
adam.saunders    2
adrian           3
adrian.blair     7
                ..
wilson           2
wking            2
wright3590       4
young            2
zachary.neal     4
Length: 410, dtype: int64

In [106]:
grouped_by_receiver.count()

               sender  amount  sent_date
receiver
aaron               6       6          6
acook               1       1          1
adam.saunders       2       2          2
adrian              3       3          3
adrian.blair        7       7          7
...               ...     ...        ...
wilson              2       2          2
wking               2       2          2
wright3590          4       4          4
young               2       2          2
zachary.neal        4       4          4

[410 rows x 3 columns]

In [107]:
grouped_by_receiver.sum()

C:\Users\gabri\AppData\Local\Temp\ipykernel_20580\1514281904.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped_by_receiver.sum()

               amount
receiver
aaron          366.15
acook           94.65
adam.saunders  101.15
adrian         124.36
adrian.blair   462.88
...               ...
wilson          44.39
wking           74.07
wright3590     195.45
young           83.57
zachary.neal   186.01

[410 rows x 1 columns]

In [108]:
# Create a new column in users called transaction count, and set the values to the size of the matching group
users['transaction_count'] = grouped_by_receiver.size()

# Not every user has made a transaction, let's see what kind of missing data we are dealing with
len(users[users.transaction_count.isna()])

65

In [109]:
# Set all missing data to 0, since in reality, there have been 0 received transactions for this user
users.transaction_count.fillna(0, inplace=True)
users

,first_name,last_name,email,email_verified,signup_date,referral_count,balance,transaction_count
aaron,Aaron,Davis,aaron6348@gmail.com,True,2018-08-31,6,18.14,6.0
acook,Anthony,Cook,cook@gmail.com,True,2018-05-12,2,55.45,1.0
adam.saunders,Adam,Saunders,adam@gmail.com,False,2018-05-29,3,72.12,2.0
adrian,Adrian,Fang,adrian.fang@teamtreehouse.com,True,2018-04-28,3,30.01,3.0
adrian.blair,Adrian,Blair,adrian9335@gmail.com,True,2018-06-16,7,25.85,7.0
...,...,...,...,...,...,...,...,...
wilson,Robert,Wilson,robert@yahoo.com,False,2018-05-16,5,59.75,2.0
wking,Wanda,King,wanda.king@holt.com,True,2018-06-01,2,67.08,2.0
wright3590,Jacqueline,Wright,jacqueline.wright@gonzalez.com,True,2018-02-08,6,18.48,4.0
young,Jessica,Young,jessica4028@yahoo.com,True,2018-07-17,4,75.39,2.0
zachary.neal,Zachary,Neal,zneal@gmail.com,True,2018-07-26,1,39.90,4.0

In [110]:
# Convert from the default type of float64 to int64 (no precision needed)
users.transaction_count = users.transaction_count.astype('int64')

In [111]:
# Sort our values by the new field descending (so the largest comes first), and then by first name ascending
users.sort_values(
    ['transaction_count', 'first_name'],
    ascending=[False, True],
    inplace=True
)
# Take a look at our top 10 receivers, showing only the columns we want
users.loc[:, ['first_name', 'last_name', 'email', 'transaction_count']].head(10)

,first_name,last_name,email,transaction_count
scott3928,Scott,NaN,scott@yahoo.com,9
sfinley,Samuel,Finley,samuel@gmail.com,8
adrian.blair,Adrian,Blair,adrian9335@gmail.com,7
hdeleon,Hannah,Deleon,hannah@yahoo.com,7
miranda6426,Miranda,Rogers,miranda.rogers@gmail.com,7
aaron,Aaron,Davis,aaron6348@gmail.com,6
corey,Corey,Fuller,fuller8100@yahoo.com,6
heather,Heather,Ray,hray@yahoo.com,6
jennifer.hebert,Jennifer,Hebert,jennifer.hebert@yahoo.com,6
edwards,Michael,Edwards,edwards5456@gmail.com,6